app/controllers/collections_controller.rb

SELECT "collections".* FROM "collections"
---
  def index
    @collections = Collection.all

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Collection.find(params[:id])

INSERT INTO "collections" ("name", "author", "created_at", "updated_at", "sounds") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ggg"], ["author", "hhh"], ["created_at", "2019-09-09 20:25:00.021286"], ["updated_at", "2019-09-09 20:25:00.021286"], ["sounds", "{h}"]]
---
  def create
    @collection = current_user.collections.build(collection_params)

    if @collection.save

UPDATE "collections" SET "name" = $1, "author" = $2, "sounds" = $3, "updated_at" = $4 WHERE "collections"."id" = $5  [["name", "TestSuccess"], ["author", "TestSuccess"], ["sounds", "{\"\",\"\"}"], ["updated_at", "2019-09-10 16:58:06.049375"], ["id", 64]]
---
  def update
    if @collection.update(collection_params)

DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 3]]
---
  def destroy
    @collection.destroy

SELECT  "collections".* FROM "collections" WHERE "collections"."user_id" = $1 AND "collections"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 77], ["LIMIT", 1]]
---
  def set_collection
    @example = current_user.collections.find(params[:id])