app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites"
---
  def index
    @favorites = Favorite.all