app/controllers/samples_controller.rb

  def index
    @samples = Sample.all
---
SELECT "samples".* FROM "samples"

  def create
    @sample = Sample.new(sample_params)

    if @sample.save
---
INSERT INTO "samples" ("name", "author", "sounds", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "kj"], ["author", "kk"], ["sounds", "nn"], ["created_at", "2019-09-10 01:16:31.779224"], ["updated_at", "2019-09-10 01:16:31.779224"]]